# AllowsAssemblyViewCreation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyInstance..::..AllowsAssemblyViewCreation Method
AssemblyInstance Class See Also
---
Returns true if assembly views can be created for this Assembly Instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool AllowsAssemblyViewCreation()
```

Visual Basic
---
```text
Public Function AllowsAssemblyViewCreation As Boolean
```

Visual C++
---
```text
public:
bool AllowsAssemblyViewCreation()
```

# Remarks
Assembly views are allowed when there are no assembly views for any instance of this type, or when the only existing assembly views belong to this instance
# See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace